results/cpu-vs-latency3/memcached/4-2/nsl203.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1999224 ops,   65645 (avg:   66640) ops/sec, 2.48MB/sec (avg: 2.51MB/sec),  0.24 (avg:  0.24) msec latency

4         Threads
4         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        6058.49          ---          ---      0.24000       449.10
Gets       60582.17     33040.23     27541.94      0.23600      2124.46
Totals     66640.66     33040.23     27541.94      0.23700      2573.56


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.000     99.99890
SET       2.000    100.00000
---
GET       0.049      0.00006
GET       0.053      0.00022
GET       0.054      0.00039
GET       0.055      0.00050
GET       0.056      0.00099
GET       0.057      0.00171
GET       0.058      0.00209
GET       0.059      0.00264
GET       0.060      0.00347
GET       0.061      0.00479
GET       0.062      0.00622
GET       0.063      0.00721
GET       0.064      0.00814
GET       0.065      0.01001
GET       0.066      0.01161
GET       0.067      0.01348
GET       0.068      0.01568
GET       0.069      0.01810
GET       0.070      0.02063
GET       0.071      0.02327
GET       0.072      0.02652
GET       0.073      0.03054
GET       0.074      0.03455
GET       0.075      0.03818
GET       0.076      0.04242
GET       0.077      0.04803
GET       0.078      0.05568
GET       0.079      0.06239
GET       0.080      0.07158
GET       0.081      0.08033
GET       0.082      0.09057
GET       0.083      0.10273
GET       0.084      0.11747
GET       0.085      0.13618
GET       0.086      0.16039
GET       0.087      0.18828
GET       0.088      0.22487
GET       0.089      0.26851
GET       0.090      0.32017
GET       0.091      0.39093
GET       0.092      0.47759
GET       0.093      0.58614
GET       0.094      0.72810
GET       0.095      0.90764
GET       0.096      1.10027
GET       0.097      1.27947
GET       0.098      1.44927
GET       0.099      1.62066
GET       0.100      2.47971
GET       0.110      4.28690
GET       0.120      6.82207
GET       0.130     10.91479
GET       0.140     21.15855
GET       0.150     33.09784
GET       0.160     39.96882
GET       0.170     45.34608
GET       0.180     50.70507
GET       0.190     58.07609
GET       0.200     64.77673
GET       0.210     69.29560
GET       0.220     72.68740
GET       0.230     75.38285
GET       0.240     77.76881
GET       0.250     79.27965
GET       0.260     80.06095
GET       0.270     80.52748
GET       0.280     80.86196
GET       0.290     81.19616
GET       0.300     81.55506
GET       0.310     81.92701
GET       0.320     82.36014
GET       0.330     82.91041
GET       0.340     83.66553
GET       0.350     84.50147
GET       0.360     85.34192
GET       0.370     86.21726
GET       0.380     87.11829
GET       0.390     88.05784
GET       0.400     88.85956
GET       0.410     89.52367
GET       0.420     90.08753
GET       0.430     90.58273
GET       0.440     91.02351
GET       0.450     91.37256
GET       0.460     91.66517
GET       0.470     91.94083
GET       0.480     92.22523
GET       0.490     92.53176
GET       0.500     92.83718
GET       0.510     93.14882
GET       0.520     93.48242
GET       0.530     93.83324
GET       0.540     94.20425
GET       0.550     94.55815
GET       0.560     94.89251
GET       0.570     95.23370
GET       0.580     95.57236
GET       0.590     95.88890
GET       0.600     96.17297
GET       0.610     96.42283
GET       0.620     96.64165
GET       0.630     96.84693
GET       0.640     97.01855
GET       0.650     97.16953
GET       0.660     97.29789
GET       0.670     97.40799
GET       0.680     97.50961
GET       0.690     97.59468
GET       0.700     97.66797
GET       0.710     97.73218
GET       0.720     97.78857
GET       0.730     97.84277
GET       0.740     97.88492
GET       0.750     97.91996
GET       0.760     97.95028
GET       0.770     97.97647
GET       0.780     97.99749
GET       0.790     98.01510
GET       0.800     98.03210
GET       0.810     98.04646
GET       0.820     98.06054
GET       0.830     98.07364
GET       0.840     98.08745
GET       0.850     98.10093
GET       0.860     98.11672
GET       0.870     98.13510
GET       0.880     98.15524
GET       0.890     98.17537
GET       0.900     98.19991
GET       0.910     98.22930
GET       0.920     98.25868
GET       0.930     98.29472
GET       0.940     98.33312
GET       0.950     98.37307
GET       0.960     98.41934
GET       0.970     98.46677
GET       0.980     98.52278
GET       0.990     98.58220
GET       1.000     98.96741
GET       1.100     99.53347
GET       1.200     99.78993
GET       1.300     99.91956
GET       1.400     99.97717
GET       1.500     99.99417
GET       1.600     99.99758
GET       1.700     99.99857
GET       1.800     99.99895
GET       1.900     99.99928
GET       2.000     99.99950
GET       2.100     99.99983
GET       2.300     99.99994
GET       2.800    100.00000